#include<iostream>
using namespace std;
int main()
{
	int x, n = 0, t = 0;			//t是留在晶晶手中的钱，n存在妈妈手中的钱
	for(int i=1; i<=12; i++) 
	{
		scanf("%d", &x);
		t = t + 300 -x;
		if(t < 0)
		{
			printf("%d\n", -i);		//如果在第i个月晶晶手上的钱不够了，输出-i
			return 0; 
		}
		if(t>=100)
		{
			n = n + t/100;			//把整百的钱存在妈妈那里 
			t%=100;					//剩余的钱留在自己手中				
		}
	}
	printf("%d\n", n*120 + t); 		//妈妈存的钱（整百）加上20%的利息，加上晶晶的钱 
	return 0;
}

//--------------------------------
//290
//230
//280
//200
//300
//170
//340
//-7
//--------------------------------
