#include<iostream>
using namespace std;
int main()
{
	int x, y, z;
	for(x=0;x<=100/5;x++)								//列举公鸡的所有可能性 
		for(y=0;y<=100/3;y++)							//列举母鸡的所有可能性 
		{
			z = 100-x-y;								//根据x,y计算小鸡的数量
			if(z%3==0 && x*5+y*3+z/3==100)				//判断总的钱数是否符合条件 
				cout << x << " " << y << " " << z << endl;
		}									
	return 0;
}

//--------------------------------
//x+y+z==100
//公鸡 × 5 + 母鸡 ×3 + 小鸡（必须是3的整倍数） / 3 == 100
//二层循环效率提高 
//0 25 75
//4 18 78
//8 11 81
//12 4 84
//--------------------------------
