#include<iostream>
using namespace std;
int main()
{
	int x, y, z;
	for(x=0;x<=100/5;x++)										//列举公鸡的所有可能性 
		for(y=0;y<=100/3;y++)									//列举母鸡的所有可能性 
			for(z=0;z<=100*3;z++)								//列举小鸡的所有可能性 
				if(x*5+y*3+z/3==100 && x+y+z==100 && z%3==0)	//满足两个方程组 
					cout << x << " " << y << " " << z << endl;
			
	return 0;
}

//--------------------------------
//x+y+z==100
//公鸡 × 5 + 母鸡 ×3 + 小鸡（必须是3的整倍数） / 3 == 100
//三层循环效率最低： 内层循环要执行(1+100/5) * (1+100/3) * (1+3*100) = 214914 次 
//0 25 75
//4 18 78
//8 11 81
//12 4 84
//--------------------------------
