#include <iostream>
using namespace std;
/*
 第46课，精益求精 
 --分数转小数 
 1 ÷7 = 0 ... 1
 1 ×10 ÷7 = 1 ... 3
 3 ×10 ÷7 = 4 ... 2
 2 ×10 ÷7 = 2 ... 6
 把上一次产生的余数扩大10倍，再除以7，得到的商就是当前数位上的数字。 
*/ 
int main()
{
	int a, b, i;
	cout << "0.";
	a = 1;        //存放的是余数： 1 ÷7 = 0 ... 1 
	i = 1;        //循环控制 
	while(i <= 100)
	{
		a *= 10;         // 余数扩大10倍
		b = a/7;         // 余数扩大10倍，再除以7， 得到商 
		cout << b;
		a %= 7;          // 为了下次循环，产生新的余数
		i++;
	}
	
	//输出其他
	cout << "" << endl;
	cout << 1/7 << endl;
	cout << 1.0/7 << endl; 
	cout << (double)1/7 << endl;
	return 0;
}

//--------------------------------
//0.1428571428571428571428571428571428571428571428571428571428571428571428571428571428571428571428571428
//--------------------------------
