#include <iostream>
using namespace std;
/*
 第46课，精益求精 
 --分数转小数 
 作业：输入三个正整数 a ，b， n。
 输出 a ÷b的值， 要求计算结果精确到小数点后n位（1<<n<<200).
 如：输入 1 3 4， 输出：0.333；
     输入2017 27 10， 输出：74.7037037037 
*/ 
int main()
{
	int a, b, n, ans, i;
	cout << "a b n = ";
	cin >> a >> b >> n;
	cout << a << "/" << b << "=";
	ans = a / b;
	cout << ans;
	cout << ".";
	
	a%=b;   //得到余数 
	for(int i=0; i<=n;i++)
	{
		ans = (a*10)/b;   //余数放大10，再次除以固定的除数 
		cout << ans;
		a = (a*10)%b;     //余数放大10，得到新的余数 
	}
	return 0;
}

//--------------------------------
//a b n = 1 3 4
//1/3=0.33333
//--------------------------------
//a b n =2017 27 10
//2017/27=74.70370370370 
//--------------------------------
